# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другую.
# n = input()
# m = input()
# print(n.count(m))
list_in = input("введи строку, в которой будем считать повторы: ")
list_enter = input("введи строку, вхождения которой нужно считать: ")
print(list_in.count(list_enter))
