# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь,
#  ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}
     
names = "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

def thesaurus(*any_names):
    names_dict_list = dict()

    for name in any_names:
        key_first_letter = name[0]
        names_dict_list[key_first_letter] = names_dict_list.setdefault(key_first_letter, []) + [name]
    return names_dict_list
        
print()
print(thesaurus(*names))
# print(thesaurus("Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"))