#1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
#  и проверяет, является ли этот день выходным. 
# num =  int(input("Введите номер дня недели от 1 до 7: ")) 
# while num < 1 or num > 7: 
#     num = int(input("проверьте вводимое значение и попробуйте еще раз")) 
# if num in range(1,6): 
#     print(str(num) + " день недели - это не выходной") 
# else: 
#     print(str(num) + " день недели - это выходной")     
print(list("hello"))